{"/docs/basics/":{"data":{"":"This section helps you get started with Hextra.\nYou will learn how to install, configure, and run your first Hugo site using this theme."},"title":"Getting Started"},"/docs/basics/advanced/":{"data":{"":"This section explores more complex features such as custom styling, shortcodes, and performance optimization."},"title":"Advanced Topics"},"/docs/basics/advanced/customization/":{"data":{"":"You can override theme layouts or styles by creating files in your layouts/ or assets/css/ directory.\nFor example, add assets/css/custom.css:"},"title":"Customizing Hextra"},"/docs/basics/advanced/performance/":{"data":{"":"Hugo and Hextra are extremely fast by default, but here are a few tips to make builds even faster:\nUse Hugo modules to avoid extra git dependencies. Minimize image sizes in the static/ folder. Use page bundles and avoid unnecessary content duplication. Run hugo --gc --minify for a clean, compressed output."},"title":"Performance Optimization"},"/docs/basics/configuration/":{"data":{"":"You can customize Hextra through the hugo.yaml file.\nSome common configuration areas include:\nSite title: Changes the top bar title Menu structure: Defines sidebar and header links SEO options: Enables meta tags, Open Graph, and Twitter cards Language settings: Supports multi-language documentation Here is a basic example:\nbaseURL: \"https://example.com\"\rtitle: \"My Documentation Site\"\rdefaultContentLanguage: \"en\"\rmenu:\rmain:\r- name: Home\rpageRef: /"},"title":"Configuration Guide"},"/docs/basics/installation/":{"data":{"":"To install the Hextra theme, you can use Hugo Modules or Git Submodules."},"title":"Installing Hextra"},"/docs/network/":{"data":{"":"This section contains topics related to network configuration and security."},"title":"Network"},"/docs/network/dns/":{"data":{"":"The Domain Name System translates human-readable domain names into IP addresses.\nDNS makes it possible to visit websites using easy-to-remember domain names instead of numeric IPs."},"title":"DNS (Domain Name System)"},"/docs/network/firewall/":{"data":{"":"Firewalls are security devices or software that control incoming and outgoing network traffic.\nThey help protect systems from unauthorized access and malicious attacks."},"title":"Firewall"},"/docs/web/":{"data":{"":"This category focuses on the core web technologies like HTML, CSS, and JavaScript."},"title":"Web Technologies"},"/docs/web/css/":{"data":{"":"CSS (Cascading Style Sheets) is used to style and format web pages.\nYou can use it to define colors, fonts, layouts, and responsive behavior."},"title":"Styling with CSS"},"/docs/web/html/":{"data":{"":"HTML (HyperText Markup Language) defines the structure of a webpage.\nIt is used to organize content such as headings, paragraphs, images, and links."},"title":"HTML Basics"}}