{"/docs/":{"data":{"":"Welcome to your site powered by the Hextra theme for Hugo.\nThis page demonstrates how headings and subheadings create a right-hand table of contents automatically.","code-block#Code Block":"hugo server --buildDrafts","example#Example":"If your document has the following:\n## Section One ### Subsection A ### Subsection B\rThen your right sidebar automatically lists:\nSection One Subsection A Subsection B","how-the-right-sidebar-works#How the Right Sidebar Works":"The right-hand sidebar in Hextra is generated from your Markdown headings.\nEvery heading level (##, ###, etc.) becomes a link in the sidebar (Table of Contents).","how-to-create-pages#How to Create Pages":"You can create new pages using Hugo’s CLI:\nhugo new path/to/page.md\rEach page can include front matter like this:\n--- title: \"New Page\" description: \"Describe your topic here\" ---","key-features#Key features":"Automatic sidebar and table of contents generation Built-in full-text search engine (FlexSearch) Syntax highlighting and Markdown enhancements Dark mode support SEO-ready configuration out of the box","lists#Lists":"Item one Item two Item three","markdown-formatting-examples#Markdown Formatting Examples":"","next-steps#Next Steps":"Now that your site is running:\nAdd more pages under content/ with proper headings. Update your sidebar menu in hugo.yaml if necessary. Customize your theme by editing assets/css/custom.css or adding configs in params:. You should now see multiple sections appear in your right sidebar — “What is Hextra?”, “How the Right Sidebar Works”, “How to Create Pages”, “Markdown Formatting Examples”, and “Next Steps”.","quote#Quote":"“Static sites are fast, simple, and secure.”","what-is-hextra#What is Hextra?":"Hextra is a modern, responsive, documentation-style theme built using Hugo and Tailwind CSS.\nIt is designed for speed, readability, and ease of customization."},"title":"Introduction"},"/docs/basics/":{"data":{"":"This section helps you get started with Hextra.\nYou will learn how to install, configure, and run your first Hugo site using this theme."},"title":"Getting Started"},"/docs/basics/advanced/":{"data":{"":"This section explores more complex features such as custom styling, shortcodes, and performance optimization."},"title":"Advanced Topics"},"/docs/basics/advanced/customization/":{"data":{"":"You can override theme layouts or styles by creating files in your layouts/ or assets/css/ directory.\nFor example, add assets/css/custom.css:"},"title":"Customizing Hextra"},"/docs/basics/advanced/performance/":{"data":{"":"Hugo and Hextra are extremely fast by default, but here are a few tips to make builds even faster:\nUse Hugo modules to avoid extra git dependencies. Minimize image sizes in the static/ folder. Use page bundles and avoid unnecessary content duplication. Run hugo --gc --minify for a clean, compressed output."},"title":"Performance Optimization"},"/docs/basics/configuration/":{"data":{"":"You can customize Hextra through the hugo.yaml file.\nSome common configuration areas include:\nSite title: Changes the top bar title Menu structure: Defines sidebar and header links SEO options: Enables meta tags, Open Graph, and Twitter cards Language settings: Supports multi-language documentation Here is a basic example:\nbaseURL: \"https://example.com\"\rtitle: \"My Documentation Site\"\rdefaultContentLanguage: \"en\"\rmenu:\rmain:\r- name: Home\rpageRef: /"},"title":"Configuration Guide"},"/docs/basics/installation/":{"data":{"":"To install the Hextra theme, you can use Hugo Modules or Git Submodules."},"title":"Installing Hextra"},"/docs/network/":{"data":{"":"This section contains topics related to network configuration and security."},"title":"Network"},"/docs/network/dns/":{"data":{"":"The Domain Name System translates human-readable domain names into IP addresses.\nDNS makes it possible to visit websites using easy-to-remember domain names instead of numeric IPs."},"title":"DNS (Domain Name System)"},"/docs/network/firewall/":{"data":{"":"Firewalls are security devices or software that control incoming and outgoing network traffic.\nThey help protect systems from unauthorized access and malicious attacks."},"title":"Firewall"},"/docs/web/":{"data":{"":"This category focuses on the core web technologies like HTML, CSS, and JavaScript."},"title":"Web Technologies"},"/docs/web/css/":{"data":{"":"CSS (Cascading Style Sheets) is used to style and format web pages.\nYou can use it to define colors, fonts, layouts, and responsive behavior."},"title":"Styling with CSS"},"/docs/web/html/":{"data":{"":"HTML (HyperText Markup Language) defines the structure of a webpage.\nIt is used to organize content such as headings, paragraphs, images, and links."},"title":"HTML Basics"}}